# Cheap Winning team for 1985:
              
              
### Catcher: Mark Salas 60000 0.332461	
### First Base: Glenn Davis	60000 0.332474
### Second Base: Tim Teufel	110000 0.335378
### Short Stop: Spike Owen 114400 0.322165	
### Third Base: Chris Brown 60000 0.345114
### Left Field: Joe Orsulak 60000 0.341920
### Center Field: Vince Coleman 60000 0.320233	
### Right Field: Glenn Davis 60000 0.332474	
### Pitchers:  they don't seem to hit

In [231]:
import pandas as pd
import scipy as sp

In [232]:
appearances = pd.read_csv("data/Appearances.csv")
batting = pd.read_csv("data/Batting.csv")
master = pd.read_csv("data/Master.csv")
salaries = pd.read_csv("data/Salaries.csv")

In [233]:
bat1 = batting[batting['yearID'] == 1985]
bat1 = bat1[['playerID','H','AB','BB','HBP','SF', 'yearID']]
bat1 = bat1.dropna()
bat1.head()

        playerID   H   AB  BB  HBP  SF  yearID
62238  abregjo01   0    9   0    0   0    1985
62240  adamsri02  23  121   5    1   0    1985
62241  agostju01   0    0   0    0   0    1985
62242  aguaylu01  46  165  22    6   3    1985
62243  aguilri01  10   36   1    0   0    1985

In [234]:
bat1["OBP"] = ""
bat1['OBP'] = (bat1.H + bat1.BB + bat1.HBP) / (bat1.AB + bat1.BB + bat1.HBP + bat1.SF)
bat2 = bat1.dropna()

In [235]:
bat2.head()

        playerID   H   AB  BB  HBP  SF  yearID       OBP
62238  abregjo01   0    9   0    0   0    1985  0.000000
62240  adamsri02  23  121   5    1   0    1985  0.228346
62242  aguaylu01  46  165  22    6   3    1985  0.377551
62243  aguilri01  10   36   1    0   0    1985  0.297297
62244  aikenwi01   4   20   3    0   1    1985  0.291667

In [236]:
#this removes the outliers with a high percent due to few times at bat as well as removing poorer players from the mix
bat3 = bat2[(bat2.OBP >= .3) & (bat2.AB > 50)]  
bat3.head()

        playerID    H   AB  BB  HBP  SF  yearID       OBP
62242  aguaylu01   46  165  22    6   3    1985  0.377551
62249  almonbi01   66  244  22    1   3    1985  0.329630
62250  anderda02   44  221  35    1   1    1985  0.310078
62255  ashbyal01   53  189  24    1   1    1985  0.362791
62258  backmwa01  142  520  36    1   3    1985  0.319643

In [237]:
appearances = appearances[['playerID', 'G_p', 'G_c', 'G_1b', 'G_2b', 'G_3b', 'G_ss', 'G_lf', 'G_cf', 'G_rf', 'yearID']]
appearances = appearances[appearances['yearID'] == 1985]
app1 = bat3.merge(appearances, on='playerID')

In [238]:
salaries = salaries[salaries['yearID'] == 1985]
salaries = salaries[['playerID', 'salary', 'yearID']]

In [239]:
salaries.head()

    playerID  salary  yearID
0  barkele01  870000    1985
1  bedrost01  550000    1985
2  benedbr01  545000    1985
3   campri01  633333    1985
4  ceronri01  625000    1985

In [240]:
master = master[['playerID', 'nameFirst', 'nameLast']]
salname = salaries.merge(master, on='playerID')
salname1 = salname[['playerID', 'salary', 'nameFirst', 'nameLast']]

In [241]:
df = salname1.merge(app1, on='playerID')

In [242]:
df1 = df[['nameFirst', 'nameLast', 'OBP', 'salary', 'G_p', 'G_c', 'G_1b', 'G_2b', 'G_3b', 'G_ss', 'G_lf', 'G_cf', 'G_rf', 'yearID_x']]

In [243]:
dfcatcher = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_c']]
dfcatcher = dfcatcher[dfcatcher['G_c'] > 0]
dfcatcher.sort('salary').head()

    nameFirst nameLast  salary       OBP  G_c
172      Alan  Knicely   60000  0.322034   46
122      Mark    Salas   60000  0.332461  115
14      Floyd  Rayford  128500  0.324324   29
117      Dave    Engle  215000  0.333333   17
243       Don  Slaught  215000  0.330623  102

In [244]:
df1b = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_1b']]
df1b = df1b[df1b['G_1b'] > 0]
df1b.sort('salary').head()

    nameFirst  nameLast  salary       OBP  G_1b
17      Larry    Sheets   60000  0.323120     1
173      Alan   Knicely   60000  0.322034     1
94      Glenn     Davis   60000  0.332474    89
116     Randy      Bush  120000  0.320755     1
39      Daryl  Sconiers  130000  0.370690     6

In [245]:
df2b = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_2b']]
df2b = df2b[df2b['G_2b'] > 0]
df2b.sort('salary').head()

    nameFirst  nameLast  salary       OBP  G_2b
124       Tim    Teufel  110000  0.335378   137
62        Tom     Foley  117500  0.321637    18
18       John    Shelby  130000  0.306604     1
244     Wayne  Tolleson  135000  0.352601    29
77      Brook    Jacoby  140000  0.323752     1

In [246]:
dfss = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_ss']]
dfss = dfss[dfss['G_ss'] > 0]
dfss.sort('salary').head()

    nameFirst   nameLast  salary       OBP  G_ss
144       Bob    Meacham  100000  0.302026   155
202     Spike       Owen  114400  0.322165   117
62        Tom      Foley  117500  0.321637    15
63        Tom      Foley  117500  0.321637    45
249      Tony  Fernandez  127500  0.340426   160

In [247]:
df3b = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_3b']]
df3b = df3b[df3b['G_3b'] > 0]
df3b.sort('salary').head()

    nameFirst  nameLast  salary       OBP  G_3b
208     Chris     Brown   60000  0.345114   120
205       Jim   Presley   71600  0.323718   154
62        Tom     Foley  117500  0.321637     1
14      Floyd   Rayford  128500  0.324324    78
244     Wayne  Tolleson  135000  0.352601    11

In [248]:
dflf = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_lf']]
dflf = dflf[dflf['G_lf'] > 0]
dflf.sort('salary').head()

    nameFirst nameLast  salary       OBP  G_lf
17      Larry   Sheets   60000  0.323120     1
222     Vince  Coleman   60000  0.320233   138
184       Joe  Orsulak   60000  0.341920    41
116     Randy     Bush  120000  0.320755    39
19       Mike    Young  121000  0.347913    83

In [249]:
dfcf = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_cf']]
dfcf = dfcf[dfcf['G_cf'] > 0]
dfcf.sort('salary').head()

    nameFirst  nameLast  salary       OBP  G_cf
222     Vince   Coleman   60000  0.320233    17
240    Oddibe  McDowell   60000  0.304251   103
184       Joe   Orsulak   60000  0.341920    72
198      Phil   Bradley  125000  0.364789    29
38       Gary    Pettis  125000  0.347140   122

In [250]:
dfrf = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_rf']]
dfrf = dfrf[dfrf['G_rf'] > 0]
dfrf.sort('salary').head()

    nameFirst nameLast  salary       OBP  G_rf
184       Joe  Orsulak   60000  0.341920    16
94      Glenn    Davis   60000  0.332474     9
17      Larry   Sheets   60000  0.323120     8
222     Vince  Coleman   60000  0.320233    10
116     Randy     Bush  120000  0.320755     4

In [251]:
dfpitcher = df1[['nameFirst', 'nameLast', 'salary', 'OBP', 'G_p']]
dfpitcher = dfpitcher[dfpitcher['G_p'] > 0]
dfpitcher.sort('salary').head()

Empty DataFrame
Columns: [nameFirst, nameLast, salary, OBP, G_p]
Index: []